Revit 2024 API
BuiltInFailures.OpeningFailures.OpeningDoesnotCutHostDelete Property
 Opening does not cut its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId OpeningDoesnotCutHostDelete { get; }
Visual Basic
Public Shared ReadOnly Property OpeningDoesnotCutHostDelete As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ OpeningDoesnotCutHostDelete {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.OpeningFailures Class
Autodesk.Revit.DB Namespace